# TagSampleText Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterTypeId..::..TagSampleText Property
ParameterTypeId Class See Also
---
"Sample Text"
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId TagSampleText { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property TagSampleText As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ TagSampleText {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace